Repository: cem256/GPT-Detector
Catalog: lib/app/l10n/arb/app_*.arb
Languages: de

source: Contribute
de: Beiträgen

source: Language
de: Sprache

source: Privacy Policy
de: Datenschuzerklärung

# drawerRateUs
source: Rate Us
de: Bewerte Uns

# drawerShareApp
source: Share App
de: App Teilen

# onboardingInfo1
source: Welcome to GPT Detector! GPT Detector predicts whether a text was written by a large language model such as ChatGPT or not.
de: Willkommen bei GPT Detector! GPT Detector analysiert, ob ein Text von einem Sprachmodell wie ChatGPT geschrieben wurde oder nicht.

# onboardingInfo2
source: For optimal results, it's highly recommended to use English text.
de: Für die beste Analyseergebnisse empfehlen wir, einen englischsprachigen Text einzugeben.

source: Get Started
de: Los geht's

# faqQuestion1
source: How results are calculated?
de: Wie funktioniert GPT Detector?

# faqQuestion1answer1
source: - Large language models like ChatGPT generate text that is typically less complex and random than human-created content. The level of randomness and complexity can be analyzed to differentiate between AI-generated and human-created content.
de: - textbasierte KI-Modelle wie ChatGPT generieren üblicherweise weniger komplexe und zufällige Texte als von Menschen erstellte Inhalte. Der Grad der Zufälligkeit und Komplexität kann analysiert werden, um zwischen von KI generierten und von Menschen erstellten Inhalten zu unterscheiden.

# faqQuestion2
source: What are the limitations of the GPT Detector?
de: Was sind die Einschränkungen des GPT Detectors?

# faqQuestion2answer1
source: - The current version of the GPT Detector is optimized for texts written in English. So, using text in other languages may result in inaccurate results.
de: - Die aktuelle Version des GPT Detectors ist für Texte in englischer Sprache optimiert. Die Verwendung von Texten in anderen Sprachen kann daher zu ungenauen Ergebnissen führen.

# faqQuestion2answer2
source: - As AI models advance, they become better at generating text that resembles human writing, which affects the reliability of the GPT Detector. Therefore, relying solely on the detector's results for decision making is not recommended.
de: - Da sich KI-Modelle weiterentwickeln, werden sie besser darin, Texte zu generieren, die menschlichem Schreiben ähneln. Daher wird nicht empfohlen, sich ausschließlich auf die Ergebnisse von GPT Detector zur Entscheidungsfindung zu verlassen.

# classificationInitial
source: Type In Text For Analysis
de: Gib Ein Text Zur Analyse

# classificationAI
source: AI Likely Written by AI
de: KI Wahrscheinlich von KI geschrieben

# classificationMixed
source: Mixed Content May Include Parts Written by AI
de: Gemischt Kann Teile enthalten, die von KI geschrieben wurden

# classificationHuman
source: Human Likely Written by Human
de: Mensch Wahrscheinlich von Mensch geschrieben

# networkFailure
source: Oops, looks like we're having trouble connecting to the server.
de: Ups, es scheint, dass wir Probleme haben, eine Verbindung zum Server herzustellen.

# noInternetFailure
source: Please check your Internet connection.
de: Bitte überprüfe deine Internetverbindung.

# unsupportedLanguage
source: Please input text in English. Using other languages may result in inaccurate results.
de: Bitte gib Text in Englisch ein. Die Verwendung anderer Sprachen kann zu ungenauen Ergebnissen führen.

# textFieldHint
source: Paste text or type here...
de: Text hier eingeben oder einfügen

# textFieldHelperShortText
source: Enter at least 250 characters.
de: Bitte gib mindestens 250 Zeichen ein.

# textFieldHelperLongText
source: Enter at most 3000 characters.
de: Bitte gib maximal 3000 Zeichen ein.

# textFieldCounterText
source: Characters: {characterCount}/250
de: Zeichen: {characterCount}/250

# analyzeText
source: Analyze
de: Text Analysieren
